using System;
using System.IO;

namespace Lessons
{
    class Lesson5
    {
        static void Main (string[] args)
        {
            //1.Ввести с клавиатуры произвольный набор данных и сохранить его в текстовый файл.
            //2.Написать программу, которая при старте дописывает текущее время в файл «startup.txt».
            //3.Ввести с клавиатуры произвольный набор чисел(0...255) и записать их в бинарный файл.
            //4.Создать класс "Сотрудник" с полями: ФИО, должность, email, телефон, зарплата, возраст;
        }
    }
}